---
title: WorksetDefaultVisibilitySettings
classe: Autodesk.Revit.DB.WorksetDefaultVisibilitySettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# WorksetDefaultVisibilitySettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `WorksetDefaultVisibilitySettings GetWorksetDefaultVisibilitySettings(Document)` | `WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(aDoc)` | WorksetDefaultVisibilitySettings |
| `Boolean IsWorksetVisible(WorksetId)` | `worksetDefaultVisibilitySettings.IsWorksetVisible(worksetId)` | Boolean |
| `Void SetWorksetVisibility(WorksetId, Boolean)` | `worksetDefaultVisibilitySettings.SetWorksetVisibility(worksetId, visible)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```